---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.FlexPipe
source: html/d7857170-4b36-e73d-5fc9-c8da79485975.htm
---
# FlexPipe Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.